In [1]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'0.25.3'

In [4]:
df = pd.read_csv("data/table.csv")
df.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

In [5]:
df_txt = pd.read_table("data/table.txt")
df_txt.head()

   col1 col2  col3    col4
0     2    a   1.4   apple
1     3    b   3.4  banana
2     6    c   2.5  orange
3     5    d   3.2   lemon

In [7]:
df_excel = pd.read_excel("data/table.xlsx")
df_excel.tail()

   School Class    ID Gender   Address  Height  Weight  Math Physics
30    S_2   C_4  2401      F  street_2     192      62  45.3       A
31    S_2   C_4  2402      M  street_7     166      82  48.7       B
32    S_2   C_4  2403      F  street_6     158      60  59.7      B+
33    S_2   C_4  2404      F  street_2     160      84  67.7       B
34    S_2   C_4  2405      F  street_6     193      54  47.6       B

In [8]:
df.to_csv("data/newnew.csv")

In [9]:
df.to_excel("data/newnew.xlsx",sheet_name = "Sheet1")

# 创建Series

In [12]:
suijishu = np.random.randn(5)
suijishu

array([-0.56393825,  0.45528083,  0.19061649,  0.17235981, -0.23394594])

In [15]:
s = pd.Series(suijishu,index=["1","2","3","4","5"]
             ,name = "这是一个Stries",dtype="float64")

In [16]:
s

1   -0.563938
2    0.455281
3    0.190616
4    0.172360
5   -0.233946
Name: 这是一个Stries, dtype: float64

In [17]:
s.values

array([-0.56393825,  0.45528083,  0.19061649,  0.17235981, -0.23394594])

In [18]:
s.name

'这是一个Stries'

In [19]:
s.index

Index(['1', '2', '3', '4', '5'], dtype='object')

In [20]:
s.dtype

dtype('float64')

In [21]:
s["1"]

-0.5639382498560189

# 创建Dataframe

In [23]:
col1 = list("abcde")
col1

['a', 'b', 'c', 'd', 'e']

In [27]:
type(range(5,10))

range

In [36]:
df  = pd.DataFrame({"col1":col1,"col2":np.random.randn(5)
                   ,"col3":[4,6,8,9,3]}
                      ,index=list("一二三四五")
                   ,dtype="float64"
                  )
#在这里面给了np.array 与Series相似 也是可以的
df

  col1      col2  col3
一    a  0.101877   4.0
二    b -1.820012   6.0
三    c -2.917397   8.0
四    d  0.358464   9.0
五    e -1.404401   3.0

In [37]:
df["col1"]

一    a
二    b
三    c
四    d
五    e
Name: col1, dtype: object

In [43]:
type(df["col1"])

pandas.core.series.Series

In [42]:
df.loc[:,"col1"]

一    a
二    b
三    c
四    d
五    e
Name: col1, dtype: object

In [44]:
type(df.loc[:,"col1"])

pandas.core.series.Series

In [45]:
df.iloc[:,0]#iloc 和 loc 要写全行 列 的索引

一    a
二    b
三    c
四    d
五    e
Name: col1, dtype: object

In [46]:
df.rename(index={"一":"one","五":"five"}
         ,columns={"col1":"new1","col3":"new3"})

     new1      col2  new3
one     a  0.101877   4.0
二       b -1.820012   6.0
三       c -2.917397   8.0
四       d  0.358464   9.0
five    e -1.404401   3.0

In [47]:
df

  col1      col2  col3
一    a  0.101877   4.0
二    b -1.820012   6.0
三    c -2.917397   8.0
四    d  0.358464   9.0
五    e -1.404401   3.0

In [48]:
df.index

Index(['一', '二', '三', '四', '五'], dtype='object')

In [49]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [50]:
df.values

array([['a', 0.10187702659189438, 4.0],
       ['b', -1.8200124940812912, 6.0],
       ['c', -2.9173973876221773, 8.0],
       ['d', 0.3584639681322443, 9.0],
       ['e', -1.4044009237280757, 3.0]], dtype=object)

In [52]:
df.mean()

col2   -1.136294
col3    6.000000
dtype: float64

In [58]:
df1 = pd.DataFrame({"A":[1,2,3]},index=list("abc"))
df2 = pd.DataFrame({"A":[3,2,1]},index=list("cba"))

In [59]:
df1 - df2#索引对齐特性

   A
a  0
b  0
c  0

In [60]:
df.drop(index="五",columns="col1")

       col2  col3
一  0.101877   4.0
二 -1.820012   6.0
三 -2.917397   8.0
四  0.358464   9.0

In [61]:
df

  col1      col2  col3
一    a  0.101877   4.0
二    b -1.820012   6.0
三    c -2.917397   8.0
四    d  0.358464   9.0
五    e -1.404401   3.0

In [62]:
df.pop("col1")

一    a
二    b
三    c
四    d
五    e
Name: col1, dtype: object

In [63]:
df

       col2  col3
一  0.101877   4.0
二 -1.820012   6.0
三 -2.917397   8.0
四  0.358464   9.0
五 -1.404401   3.0

In [64]:
df1

   A
a  1
b  2
c  3

In [66]:
df1["B"] = list("abc")

In [67]:
df1

   A  B
a  1  a
b  2  b
c  3  c

In [74]:
C = pd.Series(list("daa"))
C#看到他的索引默认是0开始

0    d
1    a
2    a
dtype: object

In [77]:
df1.assign(C = pd.Series(list("daa")))
#索引对齐特性 C当中没有df1的索引，所以右边是NaN

   A  B    C
a  1  a  NaN
b  2  b  NaN
c  3  c  NaN

In [80]:
pd.DataFrame(list("daa")).assign(df1)

TypeError: assign() takes 1 positional argument but 2 were given

In [83]:
df.select_dtypes(include=["number"])

       col2  col3
一  0.101877   4.0
二 -1.820012   6.0
三 -2.917397   8.0
四  0.358464   9.0
五 -1.404401   3.0

In [85]:
df.select_dtypes(include=["float"])

       col2  col3
一  0.101877   4.0
二 -1.820012   6.0
三 -2.917397   8.0
四  0.358464   9.0
五 -1.404401   3.0

In [87]:
s = df.mean()
s

col2   -1.136294
col3    6.000000
dtype: float64

In [90]:
s.name = "to_DataFrame"
s.name

'to_DataFrame'

In [91]:
s.to_frame()

      to_DataFrame
col2     -1.136294
col3      6.000000

In [92]:
s

col2   -1.136294
col3    6.000000
Name: to_DataFrame, dtype: float64

In [93]:
pd.DataFrame(s)

      to_DataFrame
col2     -1.136294
col3      6.000000

In [94]:
s.to_frame().T

                  col2  col3
to_DataFrame -1.136294   6.0

# 常用基本函数

In [95]:
df = pd.read_csv("data/table.csv")

In [96]:
df.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

In [97]:
df.tail()

   School Class    ID Gender   Address  Height  Weight  Math Physics
30    S_2   C_4  2401      F  street_2     192      62  45.3       A
31    S_2   C_4  2402      M  street_7     166      82  48.7       B
32    S_2   C_4  2403      F  street_6     158      60  59.7      B+
33    S_2   C_4  2404      F  street_2     160      84  67.7       B
34    S_2   C_4  2405      F  street_6     193      54  47.6       B

In [98]:
df.head(3)

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+

In [99]:
df["Physics"].nunique()

7

In [100]:
df["Physics"].unique()

array(['A+', 'B+', 'B-', 'A-', 'B', 'A', 'C'], dtype=object)

In [101]:
df.Physics.count()

35

In [102]:
df.Physics.value_counts()

B+    9
B     8
B-    6
A     4
A+    3
A-    3
C     2
Name: Physics, dtype: int64

In [103]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 9 columns):
School     35 non-null object
Class      35 non-null object
ID         35 non-null int64
Gender     35 non-null object
Address    35 non-null object
Height     35 non-null int64
Weight     35 non-null int64
Math       35 non-null float64
Physics    35 non-null object
dtypes: float64(1), int64(3), object(5)
memory usage: 2.6+ KB

In [104]:
df.describe()

               ID      Height      Weight       Math
count    35.00000   35.000000   35.000000  35.000000
mean   1803.00000  174.142857   74.657143  61.351429
std     536.87741   13.541098   12.895377  19.915164
min    1101.00000  155.000000   53.000000  31.500000
25%    1204.50000  161.000000   63.000000  47.400000
50%    2103.00000  173.000000   74.000000  61.700000
75%    2301.50000  187.500000   82.000000  77.100000
max    2405.00000  195.000000  100.000000  97.000000

In [106]:
df.describe(percentiles=[0.05,0.25,0.75,0.95])

               ID      Height      Weight       Math
count    35.00000   35.000000   35.000000  35.000000
mean   1803.00000  174.142857   74.657143  61.351429
std     536.87741   13.541098   12.895377  19.915164
min    1101.00000  155.000000   53.000000  31.500000
5%     1102.70000  157.000000   56.100000  32.640000
25%    1204.50000  161.000000   63.000000  47.400000
50%    2103.00000  173.000000   74.000000  61.700000
75%    2301.50000  187.500000   82.000000  77.100000
95%    2403.30000  193.300000   97.600000  90.040000
max    2405.00000  195.000000  100.000000  97.000000

In [107]:
df.Physics.describe()

count     35
unique     7
top       B+
freq       9
Name: Physics, dtype: object

In [108]:
df.Math.idxmax()

5

In [109]:
df.Math.idxmin()

10

In [110]:
df.Math.nlargest(5)

5     97.0
28    95.5
11    87.7
2     87.2
24    85.4
Name: Math, dtype: float64

In [111]:
df.Math.head()

0    34.0
1    32.5
2    87.2
3    80.4
4    84.8
Name: Math, dtype: float64

In [113]:
df.Math.clip(33,80).head()

0    34.0
1    33.0
2    80.0
3    80.0
4    80.0
Name: Math, dtype: float64

In [115]:
df.Math.clip_lower(33).head()

D:\Anacoda\an\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: clip_lower(threshold) is deprecated, use clip(lower=threshold) instead
  """Entry point for launching an IPython kernel.

0    34.0
1    33.0
2    87.2
3    80.4
4    84.8
Name: Math, dtype: float64

In [116]:
df.Math.clip_upper(80).head()

D:\Anacoda\an\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: clip_upper(threshold) is deprecated, use clip(upper=threshold) instead
  """Entry point for launching an IPython kernel.

0    34.0
1    32.5
2    80.0
3    80.0
4    80.0
Name: Math, dtype: float64

In [117]:
df.Math.mad()#根据平均值计算平均绝对距离差

16.924244897959188

In [118]:
df.Address.head()

0    street_1
1    street_2
2    street_2
3    street_2
4    street_4
Name: Address, dtype: object

In [120]:
df.Address.replace(["street_1","street_2"],["one","two"]).head()

0         one
1         two
2         two
3         two
4    street_4
Name: Address, dtype: object

In [121]:
df.replace({"Address":{"street_1":"one"}}).head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M       one     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

In [122]:
df.Math.apply(lambda x:str(x)+"!").head()

0    34.0!
1    32.5!
2    87.2!
3    80.4!
4    84.8!
Name: Math, dtype: object

In [124]:
df.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

In [127]:
df.apply(lambda x:x.apply(lambda x:str(x)+"!")).head()

  School Class     ID Gender    Address Height Weight   Math Physics
0   S_1!  C_1!  1101!     M!  street_1!   173!    63!  34.0!     A+!
1   S_1!  C_1!  1102!     F!  street_2!   192!    73!  32.5!     B+!
2   S_1!  C_1!  1103!     M!  street_2!   186!    82!  87.2!     B+!
3   S_1!  C_1!  1104!     F!  street_2!   167!    81!  80.4!     B-!
4   S_1!  C_1!  1105!     F!  street_4!   159!    64!  84.8!     B+!

In [128]:
df.set_index("Math").head()

     School Class    ID Gender   Address  Height  Weight Physics
Math
34.0    S_1   C_1  1101      M  street_1     173      63      A+
32.5    S_1   C_1  1102      F  street_2     192      73      B+
87.2    S_1   C_1  1103      M  street_2     186      82      B+
80.4    S_1   C_1  1104      F  street_2     167      81      B-
84.8    S_1   C_1  1105      F  street_4     159      64      B+

In [130]:
df.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

In [132]:
df.sort_values(by = "Class").head()
#原理类似于SQL中的order by，可以将数据集依照某个字段中的数据进行排序，
#该函数即可根据指定列数据也可根据指定行的数据排序。

   School Class    ID Gender   Address  Height  Weight  Math Physics
0     S_1   C_1  1101      M  street_1     173      63  34.0      A+
19    S_2   C_1  2105      M  street_4     170      81  34.2       A
18    S_2   C_1  2104      F  street_5     159      97  72.2      B+
16    S_2   C_1  2102      F  street_6     161      61  50.6      B+
15    S_2   C_1  2101      M  street_7     174      84  83.3       C

In [133]:
df.sort_values(by=["Address","Height"]).head()

   School Class    ID Gender   Address  Height  Weight  Math Physics
0     S_1   C_1  1101      M  street_1     173      63  34.0      A+
11    S_1   C_3  1302      F  street_1     175      57  87.7      A-
23    S_2   C_2  2204      M  street_1     175      74  47.2      B-
33    S_2   C_4  2404      F  street_2     160      84  67.7       B
3     S_1   C_1  1104      F  street_2     167      81  80.4      B-